sullivan986/HC32_SDK/hal/hc32f052/startup_hc32f052_gcc.s
@*******************************************************************************
@  Startup / vector table for XHSC HC32F052 (ARM Cortex-M0+, ARMv6-M)
@
@  This file is written in GNU assembler syntax and assembles with BOTH:
@    - arm-none-eabi-gcc   (GNU as)
@    - ATfE clang          (LLVM integrated assembler)
@
@  Link it with -nostartfiles together with the matching linker script
@  hc32f052.ld, e.g. (GCC):
@    arm-none-eabi-gcc -mcpu=cortex-m0plus -mthumb -nostartfiles \
@        -T hc32f052.ld startup_hc32f052_gcc.s ... -o app.elf
@  or (ATfE):
@    clang --target=arm-none-eabi -mcpu=cortex-m0plus -mthumb \
@        -nostartfiles -T hc32f052.ld startup_hc32f052_gcc.s ... -o app.elf
@
@  Symbol contract (all provided by hc32f052.ld):
@    _estack : initial stack pointer (top of RAM)
@    _sidata : load address of .data (in flash)
@    _sdata  : start of .data in RAM
@    _edata  : end   of .data in RAM
@    _sbss   : start of .bss in RAM
@    _ebss   : end   of .bss in RAM
@*******************************************************************************

    .syntax unified
    .arch   armv6-m
    .thumb

@===============================================================================
@  Interrupt vector table (must be at the very start of flash, address 0x00000000)
@===============================================================================
    .section .isr_vector, "a", %progbits
    .align  2
    .globl  __Vectors
    .globl  g_pfnVectors
    .type   g_pfnVectors, %object
g_pfnVectors:
__Vectors:
    .word   _estack                     @ 0x00  Top of Stack
    .word   Reset_Handler               @ 0x04  Reset
    .word   NMI_Handler                 @ 0x08  NMI
    .word   HardFault_Handler           @ 0x0C  Hard Fault
    .word   0                           @ 0x10  Reserved
    .word   0                           @ 0x14  Reserved
    .word   0                           @ 0x18  Reserved
    .word   0                           @ 0x1C  Reserved
    .word   0                           @ 0x20  Reserved
    .word   0                           @ 0x24  Reserved
    .word   0                           @ 0x28  Reserved
    .word   SVC_Handler                 @ 0x2C  SVCall
    .word   0                           @ 0x30  Reserved
    .word   0                           @ 0x34  Reserved
    .word   PendSV_Handler              @ 0x38  PendSV
    .word   SysTick_Handler             @ 0x3C  SysTick

    .word   PORTA_IRQHandler            @ IRQ #0
    .word   PORTB_IRQHandler            @ IRQ #1
    .word   PORTC_IRQHandler            @ IRQ #2
    .word   PORTD_IRQHandler            @ IRQ #3
    .word   DMAC_IRQHandler             @ IRQ #4
    .word   ATIM3_IRQHandler            @ IRQ #5
    .word   USART0_IRQHandler           @ IRQ #6
    .word   USART1_IRQHandler           @ IRQ #7
    .word   LPUART0_IRQHandler          @ IRQ #8
    .word   LPUART1_IRQHandler          @ IRQ #9
    .word   SPI0_IRQHandler             @ IRQ #10
    .word   SPI1_IRQHandler             @ IRQ #11
    .word   I2C0_IRQHandler             @ IRQ #12
    .word   I2C1_IRQHandler             @ IRQ #13
    .word   ATIM0_IRQHandler            @ IRQ #14
    .word   ATIM1_IRQHandler            @ IRQ #15
    .word   ATIM2_IRQHandler            @ IRQ #16
    .word   LPTIM_IRQHandler            @ IRQ #17
    .word   GTIM0_BTIM0_1_2_IRQHandler  @ IRQ #18
    .word   GTIM1_BTIM3_4_5_IRQHandler  @ IRQ #19
    .word   I2CSLV_IRQHandler           @ IRQ #20
    .word   WWDT_IRQHandler             @ IRQ #21
    .word   IWDT_IRQHandler             @ IRQ #22
    .word   RTC_IRQHandler              @ IRQ #23
    .word   ADC_IRQHandler              @ IRQ #24
    .word   Dummy_IRQHandler            @ IRQ #25
    .word   VC0_1_LVD_IRQHandler        @ IRQ #26
    .word   Dummy_IRQHandler            @ IRQ #27
    .word   CAN_IRQHandler              @ IRQ #28
    .word   ATIM_BK_IRQHandler          @ IRQ #29
    .word   FLASH_RAM_IRQHandler        @ IRQ #30
    .word   CTRIM_FAULT_IRQHandler      @ IRQ #31
    .size   g_pfnVectors, . - g_pfnVectors

@===============================================================================
@  Reset handler (runtime startup)
@===============================================================================
    .section .text.Reset_Handler, "ax", %progbits
    .align  2
    .globl  Reset_Handler
    .type   Reset_Handler, %function
    .thumb_func
Reset_Handler:
    @ --- On Cortex-M0+ VTOR defaults to 0x00000000, which is where the vector
    @ --- table lives, so no VTOR setup is required for flash execution. ---

    @ --- Copy .data from flash (LMA) to RAM (VMA) ---
    ldr     r0, =_sdata
    ldr     r1, =_edata
    ldr     r2, =_sidata
    b       .Lcopy_check
.Lcopy_loop:
    ldr     r3, [r2]
    str     r3, [r0]
    adds    r0, r0, #4
    adds    r2, r2, #4
.Lcopy_check:
    cmp     r0, r1
    bcc     .Lcopy_loop

    @ --- Zero-fill .bss ---
    ldr     r0, =_sbss
    ldr     r1, =_ebss
    movs    r3, #0
    b       .Lzero_check
.Lzero_loop:
    str     r3, [r0]
    adds    r0, r0, #4
.Lzero_check:
    cmp     r0, r1
    bcc     .Lzero_loop

    @ --- System clock / device early init (provided by system_hc32f052.c) ---
    bl      SystemInit

    @ --- Run C/C++ constructors (__init_array). Provided by newlib AND picolibc ---
    bl      __libc_init_array

    @ --- Jump to application ---
    bl      main

.Lhang:
    b       .Lhang
    .size   Reset_Handler, . - Reset_Handler

@===============================================================================
@  Default handler and weak aliases for all exception / IRQ handlers
@===============================================================================
    .section .text.Default_Handler, "ax", %progbits
    .align  2
    .globl  Default_Handler
    .type   Default_Handler, %function
    .thumb_func
Default_Handler:
    b       .
    .size   Default_Handler, . - Default_Handler

@ --- Cortex-M system exceptions (weak) ---
    .weak   NMI_Handler
    .thumb_set NMI_Handler, Default_Handler

    .weak   HardFault_Handler
    .thumb_set HardFault_Handler, Default_Handler

    .weak   SVC_Handler
    .thumb_set SVC_Handler, Default_Handler

    .weak   PendSV_Handler
    .thumb_set PendSV_Handler, Default_Handler

    .weak   SysTick_Handler
    .thumb_set SysTick_Handler, Default_Handler

@ --- Device interrupt handlers (weak) ---
    .weak   PORTA_IRQHandler
    .thumb_set PORTA_IRQHandler, Default_Handler

    .weak   PORTB_IRQHandler
    .thumb_set PORTB_IRQHandler, Default_Handler

    .weak   PORTC_IRQHandler
    .thumb_set PORTC_IRQHandler, Default_Handler

    .weak   PORTD_IRQHandler
    .thumb_set PORTD_IRQHandler, Default_Handler

    .weak   DMAC_IRQHandler
    .thumb_set DMAC_IRQHandler, Default_Handler

    .weak   ATIM3_IRQHandler
    .thumb_set ATIM3_IRQHandler, Default_Handler

    .weak   USART0_IRQHandler
    .thumb_set USART0_IRQHandler, Default_Handler

    .weak   USART1_IRQHandler
    .thumb_set USART1_IRQHandler, Default_Handler

    .weak   LPUART0_IRQHandler
    .thumb_set LPUART0_IRQHandler, Default_Handler

    .weak   LPUART1_IRQHandler
    .thumb_set LPUART1_IRQHandler, Default_Handler

    .weak   SPI0_IRQHandler
    .thumb_set SPI0_IRQHandler, Default_Handler

    .weak   SPI1_IRQHandler
    .thumb_set SPI1_IRQHandler, Default_Handler

    .weak   I2C0_IRQHandler
    .thumb_set I2C0_IRQHandler, Default_Handler

    .weak   I2C1_IRQHandler
    .thumb_set I2C1_IRQHandler, Default_Handler

    .weak   ATIM0_IRQHandler
    .thumb_set ATIM0_IRQHandler, Default_Handler

    .weak   ATIM1_IRQHandler
    .thumb_set ATIM1_IRQHandler, Default_Handler

    .weak   ATIM2_IRQHandler
    .thumb_set ATIM2_IRQHandler, Default_Handler

    .weak   LPTIM_IRQHandler
    .thumb_set LPTIM_IRQHandler, Default_Handler

    .weak   GTIM0_BTIM0_1_2_IRQHandler
    .thumb_set GTIM0_BTIM0_1_2_IRQHandler, Default_Handler

    .weak   GTIM1_BTIM3_4_5_IRQHandler
    .thumb_set GTIM1_BTIM3_4_5_IRQHandler, Default_Handler

    .weak   I2CSLV_IRQHandler
    .thumb_set I2CSLV_IRQHandler, Default_Handler

    .weak   WWDT_IRQHandler
    .thumb_set WWDT_IRQHandler, Default_Handler

    .weak   IWDT_IRQHandler
    .thumb_set IWDT_IRQHandler, Default_Handler

    .weak   RTC_IRQHandler
    .thumb_set RTC_IRQHandler, Default_Handler

    .weak   ADC_IRQHandler
    .thumb_set ADC_IRQHandler, Default_Handler

    .weak   Dummy_IRQHandler
    .thumb_set Dummy_IRQHandler, Default_Handler

    .weak   VC0_1_LVD_IRQHandler
    .thumb_set VC0_1_LVD_IRQHandler, Default_Handler

    .weak   CAN_IRQHandler
    .thumb_set CAN_IRQHandler, Default_Handler

    .weak   ATIM_BK_IRQHandler
    .thumb_set ATIM_BK_IRQHandler, Default_Handler

    .weak   FLASH_RAM_IRQHandler
    .thumb_set FLASH_RAM_IRQHandler, Default_Handler

    .weak   CTRIM_FAULT_IRQHandler
    .thumb_set CTRIM_FAULT_IRQHandler, Default_Handler

    .end
